УчетВУправляющихДляГит1/src/Documents/КВП_КорректировкаНачислений/КВП_КорректировкаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_КорректировкаНачислений</name>
  <basedOn>Document.КВП_РегистрацияОплаты</basedOn>
  <registerRecords>AccumulationRegister.УПЖКХ_Начисления</registerRecords>
  <registerRecords>AccumulationRegister.КВП_НачислениеДляОтраженияВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.КВП_НачисленныеЛьготы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.КВП_ВзаиморасчетыПоЛицевымСчетам</registerRecords>
  <registerRecords>AccumulationRegister.УПЖКХ_ДанныеДляСторнированияНачисленийПриОтсутствииПоказанийИПУ</registerRecords>
  <registerRecords>AccumulationRegister.УПЖКХ_ДанныеДляОтраженияНачисленийВРеглУчете</registerRecords>
  <attributes>
    <name>ВариантКорректировкиУслуг</name>
    <type>
      <types>EnumRef.УПЖКХ_ВариантыНастройкиКорректировкиУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНачисления</name>
    <type>
      <types>EnumRef.УПЖКХ_ВариантыНачисленийДляПерерасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПерерасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлощади</name>
    <type>
      <types>CatalogRef.УПЖКХ_ВидыПлощадей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.КВП_ВидыОперацийКорректировкаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейПерерасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПониженияТарифа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КВП_Подъезды</types>
      <types>CatalogRef.КВП_ЛицевыеСчета</types>
      <types>CatalogRef.КВП_Здания</types>
      <types>CatalogRef.УПЖКХ_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПерерасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПерерасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПониженияНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСнижения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьКакОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.КВП_Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагПониженияТарифа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовПерерасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичныйПерерасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеверныеДвижения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКорректироватьЗависимыеУслуги</name>
    <comment>Помечен на удаление в 3.0.71.4</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКорректировкаНормативныхНачисленийПоПУ</name>
    <comment>Помечен на удаление в 3.0.44.17 в связи с переработкой механизма сторнирования начислений и более недоступен для изменения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПериодКорректировки</name>
    <comment>Помечен на удаление в 3.0.44.16</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУчитыватьЗависимыеУслуги</name>
    <comment>Помечен на удаление в 3.0.71.4</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКорректировки</name>
    <type>
      <types>EnumRef.УПЖКХ_ВидыКорректировокДляОтраженияВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.УПЖКХ_ВводПоказанийСчетчика</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корректировки</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛицевойСчет</name>
      <type>
        <types>CatalogRef.КВП_ЛицевыеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛьготы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛьготнаяКатегория</name>
      <type>
        <types>CatalogRef.КВП_ЛьготныеКатегории</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПерерасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийРасчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставнаяУслуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>МесяцНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УслугаОснование</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <comment>Используется для перерасчета начислений по нормативу услуг по ПУ</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПериода</name>
      <comment>Используется для перерасчета начислений по нормативу услуг по ПУ</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>EnumRef.УПЖКХ_ВидыНачислений</types>
      </type>
    </attributes>
    <attributes>
      <name>Льготник</name>
      <type>
        <types>CatalogRef.УПЖКХ_Жильцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗависимаяПоНормативу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНачисления</name>
      <type>
        <types>EnumRef.УПЖКХ_ТипНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>КолДоИзм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифДоИзм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолПослеИзм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПослеИзм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/КВП_КорректировкаНачислений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Ответственный,
	|	Реквизиты.Организация,
	|	Реквизиты.ВариантНачисления,
	|	Реквизиты.ВидПерерасчета,
	|	Реквизиты.ВидПлощади,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.ДатаКон,
	|	Реквизиты.ДатаНач,
	|	Реквизиты.ДнейПерерасчета,
	|	Реквизиты.ЗначениеПониженияТарифа,
	|	Реквизиты.УдалитьКорректировкаНормативныхНачисленийПоПУ,
	|	Реквизиты.Объект,
	|	Реквизиты.ОснованиеПерерасчета,
	|	Реквизиты.ПроцентПерерасчета,
	|	Реквизиты.ПроцентПониженияНачисления,
	|	Реквизиты.ПроцентСнижения,
	|	Реквизиты.РегистрироватьКакОплату,
	|	Реквизиты.СуммаДокумента,
	|	Реквизиты.Услуга,
	|	Реквизиты.ВариантКорректировкиУслуг,
	|	Реквизиты.ФлагПониженияТарифа,
	|	Реквизиты.ЧасовПерерасчета,
	|	Реквизиты.ЧастичныйПерерасчет
	|ИЗ
	|	Документ.КВП_КорректировкаНачислений КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Ответственный,Организация,ВариантНачисления,
								|ВидПерерасчета,ВидПлощади,ВидОперации,ДатаКон,
								|ДатаНач,ДнейПерерасчета,ЗначениеПониженияТарифа,
								|УдалитьКорректировкаНормативныхНачисленийПоПУ,Объект,ОснованиеПерерасчета,
								|ПроцентПерерасчета,ПроцентПониженияНачисления,ПроцентСнижения,РегистрироватьКакОплату,
								|СуммаДокумента,Услуга,ВариантКорректировкиУслуг,ФлагПониженияТарифа,
								|ЧасовПерерасчета,ЧастичныйПерерасчет");
	
	// Дополним структуру реквизитов настройкой варианта изменения задолженности в корректировках начислений.
	Реквизиты.Вставить("ВариантИзмененияЗадолженностиВКорректировкахНачислений", Константы.УПЖКХ_ВариантИзмененияЗадолженностиВКорректировкахНачислений.Получить());
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
